Enums/ТочностиУказанияСрокаГодности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТочностиУказанияСрокаГодности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоМесяцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоЧасов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТочностиУказанияСрокаГодности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает форматную строку представления срока годности.
//
// Параметры:
//  ТочностьУказанияСрокаГодности	 - Перечисления.ТочностиУказанияСрокаГодности - точность указания срока годности вида номенклатуры.
// 
// Возвращаемое значение:
//  Строка - форматная строка срока годности вида номенклатуры.
//
Функция ФорматнаяСтрока(ТочностьУказанияСрокаГодности)Экспорт
	
	ФорматнаяСтрока = "";
	
	Если ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ФорматнаяСтрока = НСтр("ru='ДФ=''dd.MM.yyyy HH:00''';uk='ДФ=''dd.MM.yyyy HH:00'''");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ФорматнаяСтрока = НСтр("ru='ДФ=MM.yyyy';uk='ДФ=MM.yyyy'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоДней Тогда
		ФорматнаяСтрока = НСтр("ru='ДФ=dd.MM.yyyy';uk='ДФ=dd.MM.yyyy'");
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;
	
КонецФункции

// Возвращает представление форматной строки для вывода в элементах управления
//
// Параметры:
//  ТочностьУказанияСрокаГодности	 - Перечисления.ТочностиУказанияСрокаГодности - точность указания срока годности вида номенклатуры.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеФорматнойСтроки(ТочностьУказанияСрокаГодности)Экспорт
	
	ПредставлениеФорматнойСтроки = "";
	
	Если ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru='дата, час';uk='дата, година'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru='месяц, год';uk='місяць, рік'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоДней Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru='дата';uk='дата'");
	КонецЕсли;
	
	Возврат ПредставлениеФорматнойСтроки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
